Tekla Open API Reference for Tekla Structures 2025
String Constructor
 Creates a new string datatype instance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public String(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
The value for the string datatype.
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace